{
  "irVersion": "1.0",
  "project": "visionstudio",
  "repository": "https://github.com/ProductBuildersHQ/visionstudio",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["ProductBuildersHQ"],
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-07-19",
      "highlights": [
        { "description": "DevX usage dashboard: a new, not-project-scoped sidebar view rendering AI-assisted development activity (sessions, prompts, commits, tool usage, cost) sourced from the OmniDevX ecosystem" },
        { "description": "Read-only, disclosure-scoped boundary — the daemon never queries the OmniDevX event store, only passes through an already-generated, already-decided-safe dashboard file" }
      ],
      "added": [
        { "description": "`GET /api/devx/dashboard`: passthrough handler serving `~/.plexusone/omnidevx/dashboard.json` as-is, with a 404 pointing at the generating command when the file doesn't exist yet", "commit": "7dfcf94" },
        { "description": "`DevXDashboardView` + a dependency-free renderer for the subset of dashforge's `dashboardir.Dashboard` schema devfolio's exporter emits: metric tiles, line charts with hover tooltips, and tables", "commit": "76c1896" },
        { "description": "`api.getDevXDashboard()`, surfacing the daemon's not-found error message (with the generating command) rather than a generic HTTP status", "commit": "76c1896" },
        { "description": "DevX sidebar section (\"Usage Dashboard\") alongside Organization — both person/machine-scoped views independent of the active tracked project", "commit": "e71d32d" }
      ],
      "documentation": [
        { "description": "New guide page (guide/devx.md) explaining the not-project-scoped model and the read-only consumption boundary" },
        { "description": "Architecture docs (daemon.md, frontend.md) updated with the new handler, endpoint, and component" },
        { "description": "README: DevX Usage Dashboard feature section, daemon/component diagrams, project structure, and related projects (omnidevx-core, devfolio, dashforge)" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-07-19",
      "highlights": [
        { "description": "AIDLC workflow integration with document generation and phase transitions" },
        { "description": "V2MOM cascade management from Organization to Team to Project" },
        { "description": "Strategic planning suite with capability stack, roadmap, and maturity model" },
        { "description": "Dual methodology selection separating requirements and implementation approaches" },
        { "description": "Sample projects with Grafana (comprehensive) and Simple (minimal) examples" },
        { "description": "60+ REST API endpoints for comprehensive feature coverage" }
      ],
      "added": [
        { "description": "AIDLC workflow API handlers with phases, transitions, sync, and generation", "commit": "b754bf3" },
        { "description": "V2MOM cascade API handlers for organization, team, and project V2MOMs", "commit": "c8ecdd5" },
        { "description": "Capability stack API handlers with CRUD operations", "commit": "5cef34f" },
        { "description": "Roadmap API handlers for initiative management", "commit": "30d3752" },
        { "description": "Organization API handlers with team management", "commit": "585a0c2" },
        { "description": "Methodology selection API handlers for requirements and implementation", "commit": "1a8c915" },
        { "description": "Sample projects API handlers with import capability", "commit": "c0c0831" },
        { "description": "Wire up all new API routes in main router", "commit": "9ded3bc" },
        { "description": "API types for AIDLC, V2MOM, roadmap, capability, maturity, and methodology", "commit": "d602e0a" },
        { "description": "Organization config and project methodology fields", "commit": "d9154d2" },
        { "description": "AIDLC workflow UI components with workflow, document, and sync views", "commit": "2306b21" },
        { "description": "V2MOM cascade UI components with cascade and individual views", "commit": "6e53622" },
        { "description": "Capability stack view component", "commit": "6bb6863" },
        { "description": "Organization view component with team hierarchy", "commit": "3bdd264" },
        { "description": "Roadmap view component with timeline visualization", "commit": "785af7a" },
        { "description": "Maturity model view component with assessments", "commit": "a3d49b9" },
        { "description": "Sample picker component with Grafana and Simple examples", "commit": "2f64cd5" },
        { "description": "Evaluation display component with dimension scores", "commit": "a96fbfa" },
        { "description": "Methodology selector modal for requirements and implementation", "commit": "f50fd3d" },
        { "description": "Export new components from component index", "commit": "fd52b6a" },
        { "description": "Methodology menu and enhanced sidebar navigation", "commit": "f132672" },
        { "description": "Spec editor enhancements with AIDLC integration", "commit": "25a6141" },
        { "description": "Wire up new views in App.tsx routing", "commit": "09b67b6" },
        { "description": "TypeScript types for all new features", "commit": "bc351eb" },
        { "description": "API service methods for all new feature endpoints", "commit": "c084992" }
      ],
      "fixed": [
        { "description": "Resolve golangci-lint issues (errcheck, gosec, unparam, dupl)", "commit": "0635c08" }
      ],
      "documentation": [
        { "description": "Add user guide pages for AIDLC, V2MOM, capabilities, roadmap, maturity, methodology, samples, organization", "commit": "5b34ffa" },
        { "description": "Update architecture documentation with 60+ API endpoints", "commit": "1217ece" },
        { "description": "Update README and homepage for v0.13.0 features", "commit": "3cdc892" },
        { "description": "Update mkdocs navigation for new guides", "commit": "4e01e3c" },
        { "description": "Add AIDLC API guide and feature specs", "commit": "ca62c5c" }
      ],
      "dependencies": [
        { "description": "Upgrade visionspec from v0.12.0 to v0.13.0 with AIDLC support", "commit": "69f0383" },
        { "description": "Bump github.com/go-chi/chi/v5 from 5.3.0 to 5.3.1", "commit": "049b1ce" }
      ],
      "maintenance": [
        { "description": "Add daemon binary to gitignore", "commit": "61aeaea" },
        { "description": "Update go.mod dependencies", "commit": "34e89c7" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-07-06",
      "highlights": [
        { "description": "Initial release of VisionStudio desktop application" },
        { "description": "Go daemon with REST API for specification operations" },
        { "description": "Electron shell with React frontend and terminal integration" },
        { "description": "Workflow visualization with true AWS Working Backwards order" }
      ],
      "added": [
        { "description": "Go daemon with REST API for spec CRUD operations", "commit": "dbe7ab3" },
        { "description": "Electron desktop shell with native window controls", "commit": "c68dadf" },
        { "description": "React frontend with spec editor UI", "commit": "2fca5ad" },
        { "description": "Workflow status API endpoint", "commit": "4e31b15" },
        { "description": "Terminal infrastructure with PTY support", "commit": "b1731bc" },
        { "description": "Terminal UI with workflow integration", "commit": "431f36a" },
        { "description": "Content Security Policy headers", "commit": "ff6393c" },
        { "description": "Project Info modal with metadata display", "commit": "a90d9e2" },
        { "description": "Project configuration management with persistence", "commit": "702a3c5" },
        { "description": "Project and workflow API types", "commit": "4c9e9a3" },
        { "description": "Project management and spec operations in daemon", "commit": "57826f8" },
        { "description": "Directory picker via Electron dialog", "commit": "99f3ae0" },
        { "description": "Project management UI with add/remove support", "commit": "bf36014" },
        { "description": "Rendered HTML view with eval panel", "commit": "0e65779" },
        { "description": "Proper markdown rendering with table support", "commit": "e7738aa" },
        { "description": "Reconciliation row with Execution Spec in workflow", "commit": "9aba7d9" },
        { "description": "Consolidated All Findings view for evaluations", "commit": "8786210" },
        { "description": "ProductBuildersHQ VisionStudio branding in sidebar", "commit": "6000ae8" }
      ],
      "fixed": [
        { "description": "Use generic example-project in mock data", "commit": "d12f88c" },
        { "description": "ReadHeaderTimeout to prevent Slowloris attack", "commit": "5ac90a7" },
        { "description": "Top padding for macOS traffic lights", "commit": "721b21a" },
        { "description": "Terminal spawn and initialization issues", "commit": "6707be9" },
        { "description": "React Strict Mode IPC listener cleanup timing", "commit": "7896f80" },
        { "description": "Absolute project paths for terminal cwd", "commit": "24ff033" },
        { "description": "Workflow diagram vertical spacing", "commit": "935d4c8" },
        { "description": "Missing spec types in specMeta map", "commit": "343c5fa" },
        { "description": "Standardize spec name to Execution Spec", "commit": "72ae892" },
        { "description": "Markdown rendering with proper lists, spacing, tables", "commit": "12b6011" },
        { "description": "Sidebar header padding and connection indicator", "commit": "e802364" },
        { "description": "Use warning triangle for disconnected state", "commit": "a1a1438" },
        { "description": "Branding font size and top padding", "commit": "db965d1" }
      ],
      "changed": [
        { "description": "Rename project to VisionStudio", "commit": "9c0aa59" }
      ],
      "documentation": [
        { "description": "README and MkDocs documentation", "commit": "a9f7f20" },
        { "description": "VisionApp specification (invention)", "commit": "e680ee3" },
        { "description": "IDE terminal feature specifications", "commit": "3a071be" },
        { "description": "README screenshots", "commit": "23e6d4c" }
      ],
      "dependencies": [
        { "description": "Update visionspec to v0.12.0 with true AWS Working Backwards order and IRD support", "commit": "426661f" }
      ],
      "maintenance": [
        { "description": "Add gitignore", "commit": "1b7a087" },
        { "description": "Archive Wails v3 implementation", "commit": "b1f679d" },
        { "description": "Add shared workflow files", "commit": "f14e5f6" },
        { "description": "Remove archived Wails code", "commit": "114d00a" },
        { "description": "Remove debug logging from PTY manager", "commit": "da09c6d" }
      ]
    }
  ]
}
